clientes/app/Controllers/Home.php

    public function excluir () {

        $id = $this->request->getPost('id');

        $clienteModel = model ('ClienteModel');

        $clienteModel->delete($id);
---
DELETE FROM `clientes`
WHERE `id` IN ('16')

    public function editar ($id) {

        $clienteModel = model ('ClienteModel');

        $cliente = $clienteModel->find($id);
---
SELECT *
FROM `clientes`
WHERE `clientes`.`id` = '7'

    public function alterar ($id) {
        $nome = $this->request->getPost('nome');
        $sobrenome = $this->request->getPost('sobrenome');
        $idade = $this->request->getPost('idade');

        $dados = [
            'nome' => $nome,
            'sobrenome' => $sobrenome,
            'idade' => $idade
        ];

        //$clienteModel = new \App\Models\ClienteModel();
        $clienteModel = model('ClienteModel');

        $clienteModel->update($id, $dados);
---
UPDATE `clientes` SET `nome` = 'testsdsefe', `sobrenome` = 'tesdfger', `idade` = '55498'
WHERE `clientes`.`id` IN ('16')