clientes/app/Models/ClienteModel.php

SELECT *
FROM `clientes`
---
    public function getClientes () {
        //$query = $this->db->query ('select * from clientes;');

        //$query = $this->db->table('clientes')->like('nome', 'a')->get();

        $query = $this->db->table('clientes')->get();