agendamentos/app/Models/PacienteModel.php

    public function getPaciente () {
        //$query = $this->db->query ('select * from agendamentos;');

        //$query = $this->db->table('agendamentos')->like('nome', 'a')->get();

        $query = $this->db->table('agendamentos')->get();
---
SELECT *
FROM `agendamentos`